### Forest: Calibnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.calibnet.data.digitalocean_project.forest_project: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4003270040538543685]
module.calibnet.digitalocean_droplet.forest: Refreshing state... [id=362668932]
module.calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=fabf19a9-a0dd-4b34-9e68-bd67eb534f6f]
module.calibnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.calibnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-28T11:34:21Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "362668932" -> (known after apply)
      ~ ipv4_address         = "46.101.216.190" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "calibnet",
        ]
      ~ urn                  = "do:droplet:362668932" -> (known after apply)
      ~ user_data            = "7c75a9e7a13863de0be7cb5363f978c04d11223e" -> "6b3dbadafd4b25ee0a6da88a235001d7a563812a" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.calibnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 362668932,
        ] -> (known after apply)
        id              = "fabf19a9-a0dd-4b34-9e68-bd67eb534f6f"
        name            = "forest-calibnet-fw"
        tags            = [
            "calibnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.calibnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:362668932",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>